<template>
  <section id="faq" class="relative my-[8vw]">
    <div class="bg-[url('/svg/faq.svg')] t-0 l-0 h-full w-full bg-left-top bg-contain bg-no-repeat absolute -z-10"  alt="" />
    <div
      class="relative z-10 my-16 px-[20px] md:px-[30px] xl:my-20 xl:px-[40px] 2xl:my-24 2xl:px-[8vw]"
    >
      <div class="flex flex-col items-start gap-[8vw] xl:flex-row">
        <h2 class="text-white">вопрос-ответ</h2>
        <div class="flex flex-col gap-4 text-white xl:w-4/5">
          <div
            v-for="(item, index) in questions"
            :key="index"
            class="group rounded-lg border-2 border-white/[0.15] bg-[rgba(255,255,255,0.10)] px-5 md:px-7 lg:px-10 py-5 lg:py-7"
          >
            <Question :item="item" />
          </div>
        </div>
      </div>
    </div>
  </section>
</template>
<script>
import Question from "./question.vue";
export default {
  components: {
    Question,
  },
  data() {
    return {
      questions: [
        {
          question: "Можете ли наклеить плёнку на выезде, в моём гараже?",
          answer:
            "Твердое и одновременно хрупкое, стекло – один из самых непростых объектов ухода. На его восстановление до состояния нового уходит немало времени. К счастью, наши мастера владеют всеми необходимыми знаниями и имеют многолетний опыт работы с материалом. В сочетании с новейшим оборудованием и фирменной автохимией с устойчивым эффектом это позволяет нашей студии обслуживать автостекла неизменно быстро, качественно и с гарантией результата.",
          showAnswer: false,
        },
        {
          question:
            "Правда ли что защитная плёнка уже через пару лет желтеет и иногда совсем разрушается?",
          answer:
            "Твердое и одновременно хрупкое, стекло – один из самых непростых объектов ухода. На его восстановление до состояния нового уходит немало времени. К счастью, наши мастера владеют всеми необходимыми знаниями и имеют многолетний опыт работы с материалом. В сочетании с новейшим оборудованием и фирменной автохимией с устойчивым эффектом это позволяет нашей студии обслуживать автостекла неизменно быстро, качественно и с гарантией результата.",
          showAnswer: false,
        },
        {
          question:
            "Не испортит ли нанесение плёнки лакокрасочное покрытие моего автомобиля?",
          answer:
            "Твердое и одновременно хрупкое, стекло – один из самых непростых объектов ухода. На его восстановление до состояния нового уходит немало времени. К счастью, наши мастера владеют всеми необходимыми знаниями и имеют многолетний опыт работы с материалом. В сочетании с новейшим оборудованием и фирменной автохимией с устойчивым эффектом это позволяет нашей студии обслуживать автостекла неизменно быстро, качественно и с гарантией результата.",
          showAnswer: false,
        },
        {
          question:
            "Нужно ли как-то специально ухаживать за плёнкой после её нанесения?",
          answer:
            "Твердое и одновременно хрупкое, стекло – один из самых непростых объектов ухода. На его восстановление до состояния нового уходит немало времени. К счастью, наши мастера владеют всеми необходимыми знаниями и имеют многолетний опыт работы с материалом. В сочетании с новейшим оборудованием и фирменной автохимией с устойчивым эффектом это позволяет нашей студии обслуживать автостекла неизменно быстро, качественно и с гарантией результата.",
          showAnswer: false,
        },
      ],
    };
  },
  methods: {
    toggleAnswer(index) {
      this.questions[index].showAnswer = !this.questions[index].showAnswer;
    },
  },
};
</script>
