<template>
  <section
    id="whyUs"
    class="my-16 px-[20px] text-white md:px-[30px] xl:my-32 xl:px-[40px] 2xl:px-[8vw]"
  >
    <h2 class="mb-12">Почему мы?</h2>
    <div class="grid grid-cols-1 gap-12 lg:gap-[2.5vw] lg:grid-cols-3">
      <div>
        <img loading="lazy" src="/public/img/why-us-1.png" alt="" />
        <h3 class="my-3">Оклеиваем даже Mercedes G-класса.</h3>
        <div class="text-base font-normal md:text-lg xl:text-xl">
          У нас есть успешный опыт работы с автомобилями, наиболее сложными для
          оклейки, такими как Mercedes G-класса ("Гелендваген") и Jeep Wrangler.
          Кузов этих автомобилей имеет огромное количество мелких элементов,
          особенностей рельефа. Некоторые авто невозможно оклеить, не разобрав
          их полностью, что делает их оклейку невероятно сложной и кропотливой
          работой, с которой мы идеально справляемся!
        </div>
      </div>
      <div>
        <img loading="lazy" src="/public/img/why-us-2.png" alt="" />
        <h3 class="my-3">Знаем все тонкости</h3>
        <div class="text-base font-normal md:text-lg xl:text-xl">
          Мы оклеиваем любые автомобили - от китайских новинок до премиальных
          иномарок. Наш опыт и знания позволяют подбирать наилучший вид плёнки
          для любого случая. В том числе, мы работаем с самой дорогой плёнкой,
          нанесение которой является сложным процессом, с которым не справится
          новичок, а только профессионал с большим опытом.
        </div>
      </div>
      <div>
        <img loading="lazy" src="/public/img/why-us-3.png" alt="" />
        <h3 class="my-3">Не используем шаблоны.</h3>
        <div class="text-base font-normal md:text-lg xl:text-xl">
          При оклейке кузова мы не используем лекала, а режем плёнку сами.
          Благодаря этому плёнка на всех сложных местах (выступы, углубления,
          края) ложится с запасом, что полностью предотвращает попадание под неё
          влаги, пыли и других несущих вред для покрытия частиц.
        </div>
      </div>
    </div>
  </section>
</template>
